def solution(n):
    answer = []
    
    # n이 6이라면
    while n > 0:
        num = n % 3
        if num == 0:
            answer.insert(0, '4')
            n = n // 3 - 1 # 6 % 3 == 0이기 때문에 4 넣어주고 후 처리하면 n은 1이됨
        else:
            answer.insert(0, str(num)) # n은 1이기 때문에 앞에 1넣어줘서 14 반환
            n //= 3
            
    return ''.join(answer)

# n % 3 == 0이면 끝이 4임
#1 2 4 - 1 2 3
#11 12 14  - 4 5 6
#21 22 24  - 7 8 9
#41 42 44  - 10 11 12
#111 112 114 - 13 14 15
#121 122 124 
#141 142 144 
#211 212 214
#221 222 224
#241 242 244