# DFS 메서드 정의
def dfs(graph, v, visited):
    # 현재 노드를 방문 처리
    visited[v] = True
    print(v, end = ' ')
    # 현재 노드와 연결된 다른 노드를 재귀적으로 방문
    for i in graph[v]:
        if not visited[i]: # 방문되지 않은 상태라면
            dfs(graph, i ,visited) # 재귀함수를 통해 방문 가능
            
# 각 노드가 연결된 정보를 리스트 자료형으로 표현(2차원 리스트)
graph = [
    [], # 노드의 번호가 1번부터 시작하는 경우가 많기 때문에 index 0에 대한 정보는 비워둘 수 있도록 함
    [2, 3, 8], # 1번 index부터 해당 노드의 인접한 노드가 무엇인지 달아줌
    [1, 7],
    [1, 4, 5], 
    [3, 5], 
    [3, 4], 
    [7], 
    [2, 6, 8], 
    [1, 7]
]

# 각 노드가 방문된 정보를 리스트 자료형으로 표현(1차원 리스트)
visited = [False] * 9 
# 처음에는 모든 노드를 아직 방문하지 않은 상태 설정
# index 0은 사용하도록 하지 않기 위해서 하나 더 큰 크기로 1차원 리스트를 초기화

# 정의된 DFS 함수 호출
dfs(graph, 1, visited)

#실행결과 :: 1 2 7 6 8 3 4 5